### Function to search for given terms in a particular dataframe column

In [40]:
import pandas as pd

data = {'state': ['New York ba rk', 'Florida da', 'Arizona na'],
        'year': ['1999', '2000', '2001'],
        'pop': [100, 121, 132]}

df = pd.DataFrame(data)

In [41]:
# This function adds a column for each search term to the df
# with the count of how many times the item is found in the 
# specified df column.
# 
# Provide the df name, name of the column to search, the search
# string(s) as a list, and True/False for whether the search is
# case sensitive.

def termsearch(df, col_to_search, search_string_list, case_sensitive):
    new_df = df.copy()
    if case_sensitive:
        for term in search_string_list:
            new_df[term + '_in_' + col_to_search + '_count'] = new_df[col_to_search].str.findall(term).str.len()
    else:
        for term in search_string_list:
            new_df[term + '_in_' + col_to_search + '_count'] = new_df[col_to_search].str.lower().str.findall(term.lower()).str.len()
    return new_df

In [42]:
# Test the function
termsearch(df, 'state', ['a', 'b', 'F'], True)

,state,year,pop,a_in_state_count,b_in_state_count,F_in_state_count
0,New York ba rk,1999,100,1,1,0
1,Florida da,2000,121,2,0,1
2,Arizona na,2001,132,2,0,0

In [43]:
termsearch(df, 'state', ['a', 'b', 'F'], False)

,state,year,pop,a_in_state_count,b_in_state_count,F_in_state_count
0,New York ba rk,1999,100,1,1,0
1,Florida da,2000,121,2,0,1
2,Arizona na,2001,132,3,0,0

In [44]:
df

            state  year  pop
0  New York ba rk  1999  100
1      Florida da  2000  121
2      Arizona na  2001  132

### Ignore - random working notes below

In [16]:
df['state'].str.contains('a')

0    True
1    True
2    True
Name: state, dtype: bool

In [29]:
search_string = ['a', 'b', 'F']

for term in search_string:
    df[term + '_count'] = df['state'].str.lower().str.findall(term.lower()).str.len()

In [23]:
df['state'].str.lower()

0    new york ba rk
1        florida da
2        arizona na
Name: state, dtype: object